// 1. Вивести числа від 20 до 30 через пропуск використовуючи крок 0,5 (20 20,5 21 21,5….)

document.write(`<pre>1. Вивести числа від 20 до 30 через пропуск використовуючи крок 0,5 (20 20,5 21 21,5….)</pre>`);

let arr = [];

for (let i = 20; i <= 30; i += 0.5) {
    if (i <=30) {
    arr.push(i);
    }
}

document.write(`<p>${arr.join(', ')}</p>`);
document.write('<pre>----------------------------------------------------------------------------------------------------</pre>')

// 2. Один долар коштує 40 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів

document.write(`<pre>Один долар коштує 40 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів</pre>`);

let dollar = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100];
let hryvnia = 0;

for (let i = 10; i <= 100; i += 10) {
    hryvnia = i * 40;
    document.write(`<p>$${i} = ₴${hryvnia}</p>`);
}

document.write('<pre>----------------------------------------------------------------------------------------------------</pre>')
