// 1. Вивести числа від 20 до 30 через пропуск використовуючи крок 0,5 (20 20,5 21 21,5….)

document.write(`<pre>1. Вивести числа від 20 до 30 через пропуск використовуючи крок 0,5 (20 20,5 21 21,5….)</pre>`);

let arr = [];

for (let i = 20; i <= 30; i += 0.5) {
    if (i <=30) {
    arr.push(i);
    }
}

document.write(`<p>${arr.join(', ')}</p>`);
document.write('<pre>----------------------------------------------------------------------------------------------------</pre>')

// 2. Один долар коштує 40 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів

document.write(`<pre>Один долар коштує 40 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів</pre>`);

let hryvnia = 0;

for (let i = 10; i <= 100; i += 10) {
    hryvnia = i * 40;
    document.write(`<p>$${i} = ₴${hryvnia}</p>`);
}

document.write('<pre>----------------------------------------------------------------------------------------------------</pre>')

// 3. Дано ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N

document.write(`<pre>Дано ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N</pre>`)

let lastNumber = 100;
let firstNumber = 1;
let list = [];

while (firstNumber * firstNumber <= lastNumber) {
    list.push(firstNumber);
    firstNumber++;
}

document.write(`<p>${list.join(', ')}</p>`);
document.write('<pre>----------------------------------------------------------------------------------------------------</pre>')